from logic import *
from config import *
from telebot import TeleBot
from telebot.types import InlineKeyboardButton, InlineKeyboardMarkup, ReplyKeyboardMarkup, KeyboardButton
from telebot import types

bot = TeleBot(token)
hideBoard = types.ReplyKeyboardRemove()


@bot.message_handler(commands=['start'])
def start_command(message):
    bot.send_message(message.chat.id, """Привет! Я бота для онлайн-школы
Я помогу тебе с твои расписание занятий 
""")
    info(message)
    
@bot.message_handler(commands=['info'])
def info(message):
    bot.send_message(message.chat.id,
"""
Вот команды которые могут тебе помочь(но можешь использовать кнопки 😉):

/my_schedule - покажет твое расписание
/all_schedule - покажет расписание всех студентов
""") 
    

@bot.message_handler(commands=['my_schedule'])
def start_command(message):
    bot.send_message(message.chat.id, """Укажите свой класс:""")
    if classes == '6':
        bot.send_message(message.chat.id, ''' 
                         1. Русский язык
                         2. Литература
                         3. Математика
                         4. Анг. яз.
                         5. География
                         6. История ''')

    if classes == '5':
        bot.send_message(message.chat.id, """ 
                         1. Математика
                         2. Русский яз.
                         3. Биология
                         4. Физкультура
                         5. Литература """)
        
    elif classes == '7':
        bot.send_message(message.chat.id, """
                         1. Литература
                         2. Математика
                         3. История
                         4. Физ-ра
                         5. Анг. яз.
                         6. Биология  """) 

    elif classes == '8':
        bot.send_message(message.chat.id, """ 
                         1. История
                         2. Физика
                         3. Литература
                         4. География
                         5. Математика
                         6. Анг. яз.  """)
        
    elif classes == '9':
        bot.send_message(message.chat.id, """
                         1. Биология
                         2. География
                         3. Физика
                         4. Физкультура
                         5. История
                         6. Литература  """) 
        
    elif classes == '10':
        bot.send_message(message.chat.id, """
                         1. Химия
                         2. Математика
                         3. Биология
                         4. Физ-ра
                         5. География
                         6. Литература
                         7. Русский язык """)
                         

    elif classes == '11':
        bot.send_message(message.chat.id, """ 
                         1. Физика
                         2. Химия
                         3. Русский язык
                         4. Физ-ра
                         5. Математика
                         6. История 
                         7. География """) 


    @bot.message_handler(commands=['all_schedule'])
    def start_command(message):
        bot.send_message(message.chat.id, """ понедельник: 
                            | 5 класс      | 6 класс      | 7 класс      | 8 класс      | 9 класс      | 10 класс     | 11 класс     |
                            |--------------|--------------|--------------|--------------|--------------|--------------|--------------|
                            | Математика   | Русский язык | Литература   | История      | Биология     | Химия        | Физика       |
                            | Русский язык | Литература   | Математика   | Физика       | География    | Математика   | Химия        |
                            | Биология     | Математика   | История      | Литература   | Физика       | Биология     | Русский язык |
                            | Физкультура  | Анг. яз.     | Физкультура  | География    | Физкультура  | Физкультура  | Физкультура  |
                            | Литература   | География    | Анг. яз.     | Математика   | История      | География    | Математика   |
                            |              | История      | Биология     | Анг. яз.     | Литература   | Литература   | История      |
                            |              |              |              |              |              | Русский язык | География    |   """)











